# GetSlabShapeEditor Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Toposolid..::..GetSlabShapeEditor Method
Toposolid Class See Also
---
Gets a SlabShapeEditor that can be used to add or modify points of this Toposolid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public SlabShapeEditor GetSlabShapeEditor()
```

Visual Basic
---
```text
Public Function GetSlabShapeEditor As SlabShapeEditor
```

Visual C++
---
```text
public:
SlabShapeEditor^ GetSlabShapeEditor()
```

# ### Return Value
The SlabShapeEditor object
# See Also
Toposolid Class
Autodesk.Revit.DB Namespace